In [1]:
import numpy as np
import pandas as pd

from datetime import datetime as dt

In [2]:
myyear = 2025
mymonth = 12
myday = 27
myhour = 12
mymin = 57
mysec = 35

In [3]:
mydate = dt(myyear,mymonth,myday)

In [4]:
mydate

datetime.datetime(2025, 12, 27, 0, 0)

In [5]:
mydatetime = dt(myyear, mymonth, myday, myhour, mymin,  mysec)

In [6]:
mydatetime

datetime.datetime(2025, 12, 27, 12, 57, 35)

In [7]:
mydatetime.year

2025

In [8]:
myser = pd.Series(['Nov 3,1990',  '1999-9-17', None])

In [11]:
timeser = pd.to_datetime(myser)

C:\Users\abhisek bhujel\AppData\Local\Temp\ipykernel_4536\1142799102.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  timeser = pd.to_datetime(myser)

In [12]:
timeser

0   1990-11-03
1   1999-09-17
2          NaT
dtype: datetime64[ns]

In [14]:
timeser[0].year

1990

In [15]:
euro_date = "10-12-2000"

In [17]:
converted_euro_date = pd.to_datetime(euro_date)

In [18]:
converted_euro_date.month

10

In [19]:
real_date = pd.to_datetime(euro_date, dayfirst = True)

In [21]:
real_date.month

12

In [24]:
style_date = '12--Dec--2000'

In [23]:
pd.to_datetime(style_date, format = '%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [27]:
custom_Date = "12th of Dec 2000"

In [28]:
pd.to_datetime(custom_Date)

Timestamp('2000-12-12 00:00:00')

In [31]:
sales = pd.read_csv("RetailSales_BeerWineLiquor.csv")

In [32]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [33]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [34]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [35]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [36]:
sales = pd.read_csv("RetailSales_BeerWineLiquor.csv",parse_dates=[0])

In [37]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [38]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [39]:
sales = sales.set_index('DATE')

In [40]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [41]:
sales .resample(rule = 'A').mean(numeric_only=True)

C:\Users\abhisek bhujel\AppData\Local\Temp\ipykernel_4536\2083786563.py:1: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  sales .resample(rule = 'A').mean(numeric_only=True)

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000